#+title: FFI for Emacs.  

It is based on libffi and relies on the dynamic module support in order to be loaded into Emacs. It is relatively full-featured, but for the time being low-level.

This file is adapted from https://github.com/tromey/emacs-ffi.

** Define the ffi library

- (define-ffi-library SYMBOL NAME).  Used to define a function that lazily loads a library.

#+BEGIN_SRC emacs-lisp
(define-ffi-library test.so "/Users/jkitchin/Dropbox/emacs/projects/projects/emacs-ffi-modules/emacs-ffi-kitchinhub/test.so")
#+END_SRC

#+RESULTS:
: test.so

ffi-module uses libltdl (from libtool), which will automatically supply the correct extension if none is specified, so it's generally best to leave off the ~.so~. The library name is usually sufficient, but on a Mac, I find I have to use the full path sometimes.

** Defining ffi functions

We define lisp accessible functions like this:

#+BEGIN_SRC emacs-lisp
(define-ffi-function test-function "test_function" :int nil test.so)
(test-function) ;=> 27
#+END_SRC

#+RESULTS:
: 27

#+BEGIN_SRC emacs-lisp
(define-ffi-function test-function-char "test_function" :char nil test.so)
(test-function-char) ;=> 27
#+END_SRC

#+RESULTS:
: 27

#+BEGIN_SRC emacs-lisp
(define-ffi-function test-c-string "test_c_string" :pointer nil test.so)
(test-c-string) ; => user-ptr
#+END_SRC

#+RESULTS:
: #<user-ptr ptr=0x16d34ff98 finalizer=0x369f13094>



#+BEGIN_SRC emacs-lisp
(define-ffi-function test-add "test_add" :int [:int :int] test.so)

(test-add 23 -23) ;=> 0
#+END_SRC

#+RESULTS:
: 0

The docstring for this is not that great.

#+BEGIN_SRC emacs-lisp
(describe-function 'test-add)
#+END_SRC

#+RESULTS:
#+begin_example
test-add is a interpreted-function.

(test-add G121 G122)



G121 (:int) 
G122 (:int) 

Returns:  (:int)

#+end_example


Note there is a more sophisticated way to define a function that leads to better docstrings. 

#+BEGIN_SRC emacs-lisp
(define-ffi-function test-add "test_add"
  (:int "The sum of two numbers")
  ((:int a "A: The first number")
   (:int b "B: The second number"))
  test.so
  "Return the sum of A and B.")

(test-add 23 -23) ;=> 0
#+END_SRC

#+RESULTS:
: 0

The benefit of this more verbose signature is better docstrings for the functions in elisp.

#+BEGIN_SRC emacs-lisp
(describe-function 'test-add)
#+END_SRC

#+RESULTS:
#+begin_example
test-add is a interpreted-function.

(test-add A B)

Return the sum of A and B.

A (:int) A: The first number
B (:int) B: The second number

Returns: The sum of two numbers (:int)

#+end_example


** Make a closure

~(ffi-make-closure CIF FUNCTION)~. Make a C pointer to the Lisp function. This pointer can then be passed to C functions that need a pointer-to-function argument, and FUNCTION will be called with whatever arguments are passed in.

  CIF is a CIF as returned by ~ffi--prep-cif~. It describes the function's type (as needed by C).

  This returns a C function pointer, wrapped in the usual way as a user-pointer object.

#+BEGIN_SRC emacs-lisp
(defun callback (arg)
  (1+ arg))

(define-ffi-function test-call-callback "test_call_callback"
  :int [:pointer] test.so)

(let* ((cif (ffi--prep-cif :int [:int]))
       (pointer-to-callback (ffi-make-closure cif #'callback)))
  (test-call-callback pointer-to-callback))  ; => 23
#+END_SRC

#+RESULTS:
: 23

** Define a struct

- ~(define-ffi-struct NAME &rest SLOT...)~. A limited form of ~cl-defstruct~ that works on foreign objects. This defines a new foreign structure type named NAME. Each SLOT is of the form ~(SLOT-NAME :type TYPE)~. Each TYPE must be a foreign type.

  ~define-ffi-struct~ makes accessors for each slot of the form ~NAME-SLOT-NAME~. ~setf~ works on these accessors.

#+BEGIN_SRC emacs-lisp
(define-ffi-struct test-struct
  (stringval :type :pointer)
  (intval :type :int))

(define-ffi-function test-get-struct "test_get_struct"
  test-struct nil test.so)

(let ((struct-value (test-get-struct)))
  (list
   (ffi-get-c-string (test-struct-stringval struct-value))
   (test-struct-intval struct-value))) ; => (string 23)
#+END_SRC

#+RESULTS:
| string | 23 |


** define a union

(define-ffi-union NAME &rest SLOT...)~. Like ~define-ffi-struct~, but defines a union.

#+BEGIN_SRC emacs-lisp
(define-ffi-union test-union
  (cval :type :uchar)
  (ival :type :int))

(define-ffi-function test-get-union "test_get_union"
  test-union nil test.so)

(let ((object (test-get-union)))
    (list (test-union-ival object)
	  (test-union-cval object))) ; => (-1 25)
#+END_SRC

#+RESULTS:
| -1 | 255 |


#+BEGIN_SRC emacs-lisp  

#+END_SRC

